In [ ]:
import pandas as pd
import numpy as np

df=pd.read_csv('day1.csv')

# df['ID']=pd.Series(range(1,len(df)+1))
# df = df.reset_index(drop=True)
# df
# df['ID']=range(1,len(df)+1)
df['ID']=range(1,len(df)+1)
df['Age']=df['Age'].apply(lambda x: df['Age'].mean() if x<0 or pd.isnull(x) else x)

newdf=df.dropna(subset=['Name'])
newdf

   ID     Name   Age   Gender   Salary Joining_Date Department
0   1    Alice  25.0        F  50000.0   2020-01-10         HR
1   2      Bob  30.0        M  60000.0   2021/02/15         IT
2   3      Bob  26.0     Male  60000.0   2021-02-15         IT
3   4  Charlie  35.0        M      NaN   2019-07-25    Finance
4   5    David  26.0        F  45000.0   25-08-2020    Finance
5   6      NaN  29.0  Unknown  52000.0          NaN         HR
6   7      Eve  22.0        F  48000.0   2022-12-01        NaN
7   8    Frank  40.0        M  62000.0   2018-05-10         IT
8   9    Grace  26.0        F  55000.0   2021-11-30    Finance
9  10    Heidi  28.0      NaN  58000.0   2020-06-20         HR

In [67]:
df

   ID     Name   Age   Gender   Salary Joining_Date Department
0   1    Alice  25.0        F  50000.0   2020-01-10         HR
1   2      Bob  30.0        M  60000.0   2021/02/15         IT
2   3      Bob  26.0     Male  60000.0   2021-02-15         IT
3   4  Charlie  35.0        M      NaN   2019-07-25    Finance
4   5    David  26.0        F  45000.0   25-08-2020    Finance
5   6      NaN  29.0  Unknown  52000.0          NaN         HR
6   7      Eve  22.0        F  48000.0   2022-12-01        NaN
7   8    Frank  40.0        M  62000.0   2018-05-10         IT
8   9    Grace  26.0        F  55000.0   2021-11-30    Finance
9  10    Heidi  28.0      NaN  58000.0   2020-06-20         HR